
{
  "title":"Syllabus",
  "content":" Course Meeting Times Lectures: 2 sessions / week, 1.5 hours / session\nRecitations: 1 session / week; 1 hour / session\nPrerequisite You must complete 8.321 Quantum Theory I before attempting this course.\nDescription Relativistic Quantum Field Theory I is a one-term self-contained subject in quantum field theory. Concepts and basic techniques are developed through applications in elementary particle physics and condensed matter physics.\nTopics Why quantum field theory Principle of locality: classical field theories Action principle, Lagrangian and Hamiltonian Symmetry and Noether\u0026rsquo;s theorem Implications of relativistic symmetry What is wrong with relativistic quantum mechanics Special relativity plus quantum mechanics requires quantum field theory Continuum limit of discrete systems Many condensed matter applications Free scalar field theories Canonical quantization of a free scalar field Particle interpretation Propagators Complex scalar fields Interactions: path integral approach Path integrals for quantum mechanics Path integral for quantum scalar fields Perturbation theory: Feynman diagrams Cross section and scattering matrix Dirac theory Dirac equation and its Lorentz covariance Canonical quantization Spin and statistics Discrete symmetries Path integrals for Dirac fields Maxwell theory Gauge symmetry Canonical quantization Path integral quantization Quantum electrodynamics Feynman rules Elementary processes \\(e^+e^-\\rightarrow\\mu^+\\mu^-\\) Compton and inverse Compton scatterings Required Textbooks Peskin, Michael E., and Daniel V. Schroeder. An Introduction to Quantum Field Theory. CRC Press, 1995. ISBN: 9780201503975. (A comprehensive and pedagogical treatment of QFT starting from the basics and reaching up to the physics of the standard model.)\nWeinberg, Steven. The Quantum Theory of Fields, Volume 1: Foundations. Cambridge University Press, 2005. ISBN: 9780521670531. (A comprehensive and insightful treatment of the foundations of QFT.)\nProblem Sets Problem sets are a very important part of this course. We believe that sitting down yourself and trying to reason your way through a problem not only helps you learn the material deeply, but also develops analytical tools fundamental to a successful career in science.\nThis is particularly important for a subject such as quantum field theory which deals largely with formalism. The only way to succeed in understanding quantum field theories is by working through them!\nWe recognize that students also learn a great deal from talking to and working with each other. We therefore encourage each student to make his/her own attempt on every problem and then, having done so, to discuss the problems with one another and collaborate on understanding them more fully. The solutions you submit must reflect your own work. They must not be transcriptions or reproductions of other people\u0026rsquo;s work. Plagiarism is a serious offense and is easy to recognize. Don\u0026rsquo;t submit work which is not your own.\nProblem sets are normally posted on the course website on Monday and will be due on Monday one week later. Any late problem set will be only counted as half credit. For example, if you get 90% on a late problem set, it will only count as 45%. However, your lowest problem set score will be discarded at the end of the semester; only the remaining n − 1 will be used in determining your grade.\nGrading There is no exam for this course. The course grade will be based 100% on homework. The faculty may alter grades to reflect class participation, improvement, effort, and other qualitative measures of performance.\n"}


