
{
  "title":"Readings",
  "content":" Required Textbooks [P\u0026amp;S] = Peskin, Michael E., and Daniel V. Schroeder. An Introduction to Quantum Field Theory. CRC Press, 1995. ISBN: 9780201503975. (A comprehensive and pedagogical treatment of QFT starting from the basics and reaching up to the physics of the standard model.)\n[SW] = Weinberg, Steven. The Quantum Theory of Fields, Volume 1: Foundations. Cambridge University Press, 2005. ISBN: 9780521670531. (A comprehensive and insightful treatment of the foundations of QFT.)\nRecommended Books Zee, Anthony. Quantum Field Theory in a Nutshell. Princeton University Press, 2003. ISBN: 9780691010199. (A fun book that deals briefly with many of the key ideas and uses of QFT.)\nSrednicki, Mark. Quantum Field Theory. Cambridge University Press, 2007. ISBN: 9780521864497. (Very readable and comprehensive. Structured somewhat differently from this course. Part I (spin 0) and Part II (spin 1/2) are available at Quantum Field Theory: Spin Zero and Quantum Field Theory: Spin One Half.)\nBanks, Tom. Modern Quantum Field Theory: A Concise Introduction. Cambridge University Press, 2008. ISBN: 9780521850827. (Modern, insightful treatment of many important topics.)\nSchwartz, Matthew. Quantum Field Theory and the Standard Model. Cambridge University Press, 2013. ISBN: 9781107034730. (A well-written introduction to QFT that emphasizes physical intuition alongside calculations. Self-contained, and covers both canonical quantization and the path integral approach.)\nBrown, Lowell S. Quantum Field Theory. Cambridge, UK: Cambridge University Press, 1994. ISBN: 9780521469463. (A modern path integral presentation of QFT. Covers QED but not QCD.)\nRamond, Pierre. Field Theory: A Modern Primer (second edition). Levant Books, 2007. ISBN: 9788187169840. (A book dealing efficiently with QFT in the path integral approach.)\nRyder, Lewis. Quantum Field Theory (second edition). Cambridge University Press, 1996. ISBN: 9780521478144. (A modern pedagogical introduction to QFT including the Weinberg-Salam model and other selected topics.)\nMandl, Franz, and Graham Shaw. Quantum Field Theory. John Wiley \u0026amp; Sons, 1984. ISBN: 9780471906506. (A clear and concise introduction to the basic computations in quantum field theory.)\nReadings for Problem Sets Problem Sets Readings Problem Set 1 [P\u0026amp;S] Sections 2.1–2.2 [SW] Chapter 1 Problem Set 2 [P\u0026amp;S] Chapter 2 [SW] Chapter 1 Problem Set 3 [P\u0026amp;S] Chapter 2 [SW] Chapter 1 Problem Set 4 [P\u0026amp;S] Sections 4.1–4.4 and 9.1–9.2 Problem Set 5 [P\u0026amp;S] Sections 4.1–4.4 and 9.1–9.2 Problem Set 6 [P\u0026amp;S] Sections 4.1–4.6 and 9.1–9.2 Problem Set 7 [P\u0026amp;S] Chapter 3 Problem Set 8 [P\u0026amp;S] Chapter 3 Problem Set 9 [P\u0026amp;S] Chapter 3 Problem Set 10 [P\u0026amp;S] Chapter 3, Section 4.7, and Section 9.5 Problem Set 11 [P\u0026amp;S] Section 9.4 Problem Set 12 [P\u0026amp;S] Sections 4.5–4.8 and Chapter 5 "}


